# ElementMulticategoryFilter Constructor (ICollection(BuiltInCategory)) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementMulticategoryFilter Constructor (ICollection<(Of <(<'BuiltInCategory>)>)>)
ElementMulticategoryFilter Class See Also
---
Constructs a new instance of a filter to match elements by built-in category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories
)
```

Visual Basic
---
```text
Public Sub New ( _
	categories As ICollection(Of BuiltInCategory) _
)
```

Visual C++
---
```text
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories
)
```

# ### Parameters
categories
    Type: System.Collections.Generic..::..ICollection<(Of <(<'BuiltInCategory>)>)> The built-in categories to match.
# See Also
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace